zeranemesis/Marioparty4/partyboard/src/REL/m408Dll/object.c
#include "game/audio.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/hu3d.h"
#include "game/sprite.h"

#include "REL/m408Dll.h"

#include "ext_math.h"

#ifndef __MWERKS__
#include "game/frand.h"
#include "version.h"
#endif
s32 rand8(void);

typedef struct struct_data_20C {
    s32 unk0;
    float unk4;
    float unk8;
} StructData20C;

typedef struct struct_bss_da4 {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    Vec unkC;
    Vec unk18;
    Vec unk24;
    float unk30;
    Vec unk34;
    float unk40[2];
    float unk48;
    float unk4C;
    s32 unk50;
    s32 unk54;
    s32 unk58;
    s32 unk5C;
    s32 unk60;
    float unk64;
} StructBssDA4;

void fn_1_12C6C(StructBssDA4 *arg0);
void fn_1_1305C(StructBssDA4 *arg0);
void fn_1_134D8(StructBssDA4 *arg0);
void fn_1_13820(StructBssDA4 *arg0);
void fn_1_13D88(StructBssDA4 *arg0);
void fn_1_1406C(StructBssDA4 *arg0);
void fn_1_144D0(StructBssDA4 *arg0);
void fn_1_14DB4(StructBssDA4 *arg0);
void fn_1_151A4(StructBssDA4 *arg0);

s32 lbl_1_data_1A0[9] = {
    DATA_MAKE_NUM(DATADIR_M408, 0x12),
    DATA_MAKE_NUM(DATADIR_M408, 0x12),
    DATA_MAKE_NUM(DATADIR_M408, 0x12),
    DATA_MAKE_NUM(DATADIR_M408, 0x12),
    DATA_MAKE_NUM(DATADIR_M408, 0x12),
    DATA_MAKE_NUM(DATADIR_M408, 0x14),
    DATA_MAKE_NUM(DATADIR_M408, 0x14),
    DATA_MAKE_NUM(DATADIR_M408, 0x16),
    DATA_MAKE_NUM(DATADIR_M408, 0x17),
};

s32 lbl_1_data_1C4[9] = {
    DATA_MAKE_NUM(DATADIR_M408, 0x13),
    DATA_MAKE_NUM(DATADIR_M408, 0x13),
    DATA_MAKE_NUM(DATADIR_M408, 0x13),
    DATA_MAKE_NUM(DATADIR_M408, 0x13),
    DATA_MAKE_NUM(DATADIR_M408, 0x13),
    DATA_MAKE_NUM(DATADIR_M408, 0x15),
    DATA_MAKE_NUM(DATADIR_M408, 0x15),
    0,
    0,
};

typedef void (*BssDA4Func)(StructBssDA4 *arg0);

BssDA4Func lbl_1_data_1E8[9] = { fn_1_12C6C, fn_1_1305C, fn_1_134D8, fn_1_13820, fn_1_13D88, fn_1_1406C, fn_1_144D0, fn_1_14DB4, fn_1_151A4 };

StructData20C lbl_1_data_20C[] = {
    { 0, 10600, 100 },
    { 0, 10600, 290 },
    { 7, 10500, 0 },
    { 7, 10400, 72 },
    { 7, 10300, 144 },
    { 7, 10200, 216 },
    { 7, 10100, 288 },
    { 5, 9600, 0 },
    { 7, 9000, 0 },
    { 7, 9000, 72 },
    { 7, 9000, 144 },
    { 7, 9000, 216 },
    { 7, 9000, 288 },
    { 1, 8600, 150 },
    { 7, 8500, 216 },
    { 7, 8400, 288 },
    { 7, 8300, 0 },
    { 7, 8200, 72 },
    { 7, 8100, 144 },
    { 6, 7700, 0 },
    { 6, 7700, 180 },
    { 7, 7500, 165 },
    { 7, 7500, 285 },
    { 7, 7500, 45 },
    { 8, 7000, 225 },
    { 8, 7000, 345 },
    { 8, 7000, 105 },
    { 7, 6500, 165 },
    { 7, 6500, 285 },
    { 7, 6500, 45 },
    { 4, 5500, 0 },
    { 4, 5500, 120 },
    { 4, 5500, 240 },
    { 7, 4700, 0 },
    { 7, 4700, 72 },
    { 7, 4700, 144 },
    { 7, 4700, 216 },
    { 7, 4700, 288 },
    { 5, 4500, 120 },
    { 7, 4250, 165 },
    { 7, 4250, 285 },
    { 7, 4250, 45 },
    { 5, 4000, 120 },
    { 7, 3750, 225 },
    { 7, 3750, 345 },
    { 7, 3750, 105 },
    { 5, 3500, 240 },
    { 7, 3250, 165 },
    { 7, 3250, 285 },
    { 7, 3250, 45 },
    { 7, 2100, 36 },
    { 7, 2100, 108 },
    { 7, 2100, 180 },
    { 7, 2100, 252 },
    { 7, 2100, 324 },
    { 3, 1500, 0 },
    { 3, 1500, 120 },
    { 3, 1500, 240 },
    { 8, 1300, 165 },
    { 8, 1300, 285 },
    { 8, 1300, 45 },
    { -1, 10000, 0 },
};

GXColor lbl_1_data_4F4[4] = { { 255, 255, 255, 255 }, { 255, 255, 0, 255 }, { 0, 255, 255, 255 }, { 255, 200, 200, 255 } };

u8 lbl_1_data_504[] = { 5, 3, 1, 0 };

float lbl_1_data_508[3] = { 72, 120, 0 };

float lbl_1_data_514[3] = { 0, 60, 0 };

float lbl_1_data_520[3] = { 30, 60, 90 };

Vec lbl_1_data_52C[3] = { { 1500, 2500, 1500 }, { 0, 1, 0 }, { 0, 0, 0 } };

omObjData *lbl_1_bss_75A8;
omObjData *lbl_1_bss_75A4;
StructBssDA4 lbl_1_bss_DA4[256];
s32 lbl_1_bss_DA0;
s32 lbl_1_bss_D9C;
Vec lbl_1_bss_D6C[4];
Vec lbl_1_bss_16C[256];
u32 lbl_1_bss_168;

void fn_1_11960(omObjData *object);
void fn_1_15BCC(omObjData *object);

void fn_1_118D0(Process *objman)
{
    lbl_1_bss_168 = 0;
    lbl_1_bss_75A8 = omAddObjEx(objman, 40, 256, 1, -1, fn_1_11960);
    lbl_1_bss_75A4 = omAddObjEx(objman, 41, 4, 0, -1, fn_1_15BCC);
}

void fn_1_11E3C(StructBssDA4 *arg0, s32 arg1);
void fn_1_12354(omObjData *object);
void fn_1_123C8(omObjData *object);

void fn_1_155E0(s16 arg0, s16 arg1);
void fn_1_15658(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);

void fn_1_11960(omObjData *object)
{
    StructBssDA4 *temp_r31;
    s32 temp_r29;
    s16 temp_r28;
    s16 temp_r27;
    s16 temp_r26;
    s16 temp_r25;
    s16 temp_r24;
    s16 temp_r23;
    s16 temp_r22;
    temp_r31 = &lbl_1_bss_DA4[0];
    lbl_1_bss_DA0 = 0;
    lbl_1_bss_D9C = 0;
    while (lbl_1_data_20C[lbl_1_bss_DA0].unk0 != -1) {
        if (lbl_1_data_20C[lbl_1_bss_DA0].unk0 == 7) {
            lbl_1_bss_D9C++;
        }
        lbl_1_bss_DA0++;
    }
    object->stat |= 0x100;
    temp_r27 = temp_r26 = temp_r25 = temp_r24 = -1;
    for (temp_r29 = 0; temp_r29 < lbl_1_bss_DA0; temp_r29++, temp_r31++) {
        fn_1_11E3C(temp_r31, temp_r29);
        switch (temp_r31->unk0) {
            case 0:
            case 1:
            case 2:
            case 3:
            case 4:
                if (temp_r27 < 0) {
                    temp_r27 = Hu3DModelCreateFile(lbl_1_data_1A0[temp_r31->unk0]);
                    temp_r23 = Hu3DJointMotionFile(temp_r27, lbl_1_data_1C4[temp_r31->unk0]);
                    Hu3DModelAttrSet(temp_r27, HU3D_MOTATTR_LOOP);
                    Hu3DMotionSet(temp_r27, temp_r23);
                    temp_r28 = temp_r27;
                }
                else {
                    temp_r28 = Hu3DModelLink(temp_r27);
                }
                break;

            case 5:
            case 6:
                if (temp_r26 < 0) {
                    temp_r26 = Hu3DModelCreateFile(lbl_1_data_1A0[temp_r31->unk0]);
                    temp_r22 = Hu3DJointMotionFile(temp_r26, lbl_1_data_1C4[temp_r31->unk0]);
                    Hu3DModelAttrSet(temp_r26, HU3D_MOTATTR_LOOP);
                    Hu3DMotionSet(temp_r26, temp_r22);
                    temp_r28 = temp_r26;
                }
                else {
                    temp_r28 = Hu3DModelLink(temp_r26);
                }
                break;

            case 7:
                if (temp_r25 < 0) {
                    temp_r25 = Hu3DModelCreateFile(lbl_1_data_1A0[temp_r31->unk0]);
                    temp_r28 = temp_r25;
                }
                else {
                    temp_r28 = Hu3DModelLink(temp_r25);
                }
                break;

            case 8:
                if (temp_r24 < 0) {
                    temp_r24 = Hu3DModelCreateFile(lbl_1_data_1A0[temp_r31->unk0]);
                    temp_r28 = temp_r24;
                }
                else {
                    temp_r28 = Hu3DModelLink(temp_r24);
                }
                break;

            default:
                break;
        }
        object->model[temp_r29] = temp_r28;
        Hu3DModelPosSetV(object->model[temp_r29], &temp_r31->unkC);
        Hu3DModelRotSetV(object->model[temp_r29], &temp_r31->unk34);
        Hu3DModelScaleSet(object->model[temp_r29], 0.15f, 0.15f, 0.15f);
        Hu3DModelCameraSet(object->model[temp_r29], 1);
        Hu3DModelAttrSet(object->model[temp_r29], HU3D_ATTR_DISPOFF);
        if (temp_r31->unk0 < 7) {
            Hu3DModelAttrSet(object->model[temp_r29], HU3D_MOTATTR_LOOP);
        }
    }
    for (temp_r29 = lbl_1_bss_DA0; temp_r29 < lbl_1_bss_DA0 + lbl_1_bss_D9C; temp_r29++) {
        temp_r28 = Hu3DParticleCreate(HuSprAnimReadFile(DATA_MAKE_NUM(DATADIR_M408, 0x18)), 32);
        object->model[temp_r29] = temp_r28;
        Hu3DModelAttrSet(temp_r28, HU3D_ATTR_DISPOFF);
        Hu3DModelLayerSet(temp_r28, 6);
        Hu3DParticleColSet(temp_r28, 255, 255, 255);
        Hu3DParticleHookSet(temp_r28, fn_1_15658);
        Hu3DModelPosSet(temp_r28, 0, 0, 0);
        fn_1_155E0(temp_r28, 0);
    }
    object->func = fn_1_12354;
}

void fn_1_11E3C(StructBssDA4 *arg0, s32 arg1)
{
    float temp_f31;
    float temp_f30;
    s32 temp_r29;
    temp_r29 = 0;
    temp_f30 = 40;
    temp_f31 = 20;
    arg0->unk0 = lbl_1_data_20C[arg1].unk0;
    arg0->unk4 = arg1;
    arg0->unk8 = -1;
    arg0->unk18.x = arg0->unkC.x = 0;
    arg0->unk18.y = arg0->unkC.y = lbl_1_data_20C[arg1].unk4;
    arg0->unk18.z = arg0->unkC.z = 0;
    arg0->unk24.x = arg0->unk24.y = arg0->unk24.z = 0;
    arg0->unk48 = 180;
    arg0->unk34.x = arg0->unk34.z = arg0->unk34.y = 0;
    arg0->unk40[0] = arg0->unk40[1] = 0;
    arg0->unk30 = 0;
    arg0->unk4C = 1;
    arg0->unk50 = 1;
    arg0->unk54 = 0;
    arg0->unk5C = 1;
    arg0->unk58 = 0;
    arg0->unk60 = 0;
    arg0->unk64 = 0;
    switch (arg0->unk0) {
        case 0:
            arg0->unk64 = temp_f31 + (rand8() % (int)temp_f30);
            arg0->unk30 = lbl_1_data_20C[arg1].unk8;
            arg0->unk34.y = 180 + (-arg0->unk30 + 90);

            break;

        case 1:
            arg0->unk34.y = arg0->unk40[0] = 180 + (-arg0->unk30 + 90);
            arg0->unk30 = rand8() % 360;
            break;

