zeranemesis/Marioparty4/partyboard/src/REL/m408Dll/object.c
        case 2:
            arg0->unk30 = lbl_1_data_20C[arg1].unk8;
            arg0->unk34.y = 90 + (180 + (-arg0->unk30 + 90));
            break;

        case 3:
            arg0->unk30 = lbl_1_data_20C[arg1].unk8;
            arg0->unk34.y = (180 + (-arg0->unk30 + 90)) - 90;
            break;

        case 4:
            arg0->unk30 = lbl_1_data_20C[arg1].unk8;
            arg0->unk34.y = 180 + (-arg0->unk30 + 90);
            break;

        case 5:
            arg0->unk30 = rand8() % 360;
            arg0->unk34.y = 180 + (-arg0->unk30 + 90);
            arg0->unk48 = 0;
            break;

        case 6:
            arg0->unk30 = lbl_1_data_20C[arg1].unk8;
            arg0->unk34.y = -arg0->unk30 + 90;
            break;

        case 7:
        case 8:
            arg0->unk30 = lbl_1_data_20C[arg1].unk8;
            arg0->unk8 = lbl_1_bss_DA0 + temp_r29;
            temp_r29++;
            break;
    }
    if (arg0->unk34.y > 360) {
        arg0->unk34.y -= 360;
    }
    else {
        if (arg0->unk34.y < 0) {
            arg0->unk34.y += 360;
        }
    }
}

void fn_1_12354(omObjData *object)
{
    u32 temp_r30 = fn_1_6878();
    if (temp_r30 == 2) {
        s32 temp_r31;
        for (temp_r31 = 0; temp_r31 < lbl_1_bss_DA0; temp_r31++)
            ;
        object->func = fn_1_123C8;
    }
}

void fn_1_12670(omObjData *object);
float fn_1_12674(StructBssDA4 *object);
void fn_1_127A0(StructBssDA4 *object);

void fn_1_123C8(omObjData *object)
{
    StructBssDA4 *temp_r31;
    s32 temp_r29;
    u32 temp_r28;
    temp_r31 = &lbl_1_bss_DA4[0];
    lbl_1_bss_168 = 0;
    for (temp_r29 = 0; temp_r29 < lbl_1_bss_DA0; temp_r29++, temp_r31++) {
        if (temp_r31->unk50 == 1) {
            lbl_1_data_1E8[temp_r31->unk0](temp_r31);
            if (temp_r31->unk5C == 0) {
                fn_1_127A0(temp_r31);
            }
            Hu3DModelPosSetV(object->model[temp_r29], &temp_r31->unkC);
            Hu3DModelRotSetV(object->model[temp_r29], &temp_r31->unk34);
            Hu3DModelScaleSet(object->model[temp_r29], 0.15f * temp_r31->unk4C, 0.15f * temp_r31->unk4C, 0.15f * temp_r31->unk4C);
            if (temp_r31->unkC.y > fn_1_6888() - 1000 && temp_r31->unkC.y < fn_1_6888() + 200) {
                Hu3DModelAttrReset(object->model[temp_r29], HU3D_ATTR_DISPOFF);
            }
            else {
                Hu3DModelAttrSet(object->model[temp_r29], HU3D_ATTR_DISPOFF);
            }
            if (temp_r31->unk0 == 7 || temp_r31->unk0 == 8) {
                if (temp_r31->unkC.y > fn_1_6888() - 150 && temp_r31->unkC.y < fn_1_6888() + 10) {
                    lbl_1_bss_16C[lbl_1_bss_168++] = temp_r31->unkC;
                }
            }
        }
        else {
            Hu3DModelAttrSet(object->model[temp_r29], HU3D_ATTR_DISPOFF);
        }
    }
    temp_r28 = fn_1_6878();
    if (temp_r28 == 5) {
        for (temp_r29 = 0; temp_r29 < lbl_1_bss_DA0; temp_r29++, temp_r31++) {
            Hu3DModelAttrSet(object->model[temp_r29], HU3D_ATTR_DISPOFF);
        }
        object->func = fn_1_12670;
    }
}

void fn_1_12670(omObjData *object) { }

void fn_1_15618(s16 arg0, float arg1, float arg2, float arg3);
void fn_1_15B50(s16 arg0);

float fn_1_12674(StructBssDA4 *arg0)
{
    Vec sp8;
    float temp_f31;
    float temp_f30;
    float temp_f29;
    Work2FAC *temp_r31;
    s32 temp_r30;
    temp_f30 = -1;
    temp_f29 = 10000;
    for (temp_r30 = 0; temp_r30 < 4; temp_r30++) {
        temp_r31 = fn_1_68A8(temp_r30);
        if (temp_r31->unk4 & 0x10) {
            continue;
        }
        sp8.x = temp_r31->unk1C.x - arg0->unk24.x;
        sp8.y = 0;
        sp8.z = temp_r31->unk1C.z - arg0->unk24.z;
        temp_f31 = VECMag(&sp8);
        if (temp_f31 < temp_f29) {
            temp_f30 = atan2d(sp8.x, sp8.z);
            temp_f29 = temp_f31;
        }
    }
    return temp_f30;
}

void fn_1_127A0(StructBssDA4 *arg0)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f26;
    float temp_f23;
    Work2FAC *temp_r31;
    s32 temp_r29;
    temp_f23 = 14;
    for (temp_r29 = 0; temp_r29 < 4; temp_r29++) {
        temp_r31 = fn_1_68A8(temp_r29);
        if (temp_r31->unk4 & 0x12) {
            continue;
        }
        switch (arg0->unk0) {
            case 0:
            case 1:
            case 2:
            case 3:
            case 4:
            case 7:
            case 8:
                temp_f31 = temp_r31->unk1C.x - arg0->unk24.x;
                temp_f29 = temp_r31->unk1C.y - arg0->unk24.y;
                temp_f30 = temp_r31->unk1C.z - arg0->unk24.z;
                temp_f26 = VECMagPoint(temp_f31, temp_f29, temp_f30);
                break;

            case 5:
            case 6:
                temp_f31 = temp_r31->unk1C.x - arg0->unk24.x;
                temp_f30 = temp_r31->unk1C.z - arg0->unk24.z;
                temp_f26 = VECMagPoint(temp_f31, 0, temp_f30);
                break;
        }
        if (temp_f26 < temp_f23 && 0.0f != temp_f26) {
            if (arg0->unk0 != 7 && arg0->unk0 != 8) {
                temp_r31->unk4 |= 0x1;
                temp_r31->unk40.x = temp_f31;
                temp_r31->unk40.z = temp_f30;
                lbl_1_bss_D6C[temp_r29].x = (0.5f * temp_f31) + arg0->unk24.x;
                lbl_1_bss_D6C[temp_r29].z = (0.5f * temp_f30) + arg0->unk24.z;
                lbl_1_bss_D6C[temp_r29].y = temp_r31->unk1C.y;
                lbl_1_bss_75A4->work[0] = temp_r29;
            }
            else {
                arg0->unk58 = 1;
                if (arg0->unk0 == 8) {
                    temp_r31->unk14 += 5;
                    fn_1_67C4(temp_r29, 5);
                }
                else {
                    temp_r31->unk14 += 1;
                    fn_1_67C4(temp_r29, 1);
                }
            }
        }
    }
}

void fn_1_12C6C(StructBssDA4 *arg0)
{
    float temp_f31;
    float temp_f30;
    float temp_f26;
    float temp_f25;
    temp_f26 = cosd(arg0->unk30);
    temp_f25 = sind(arg0->unk30);
    arg0->unkC.x = temp_f26 * arg0->unk64;
    arg0->unkC.z = temp_f25 * arg0->unk64;
    temp_f30 = fn_1_6888();
    switch (arg0->unk54) {
        case 0:
            if (arg0->unkC.y > temp_f30) {
                arg0->unk60 = 0;
                arg0->unk54 = 1;
            }
            arg0->unk34.x = fn_1_883C(arg0->unk34.x, -30, 0.1f);
            arg0->unk5C = 1;
            break;

        case 1:
            arg0->unk5C = 0;
            arg0->unkC.y = temp_f30;
            arg0->unk24.x = arg0->unkC.x;
            arg0->unk24.y = arg0->unkC.y + 5.0f;
            arg0->unk24.z = arg0->unkC.z;
            temp_f31 = fn_1_12674(arg0);
            if (temp_f31 >= 0) {
                arg0->unk34.y = fn_1_883C(arg0->unk34.y, temp_f31, 0.1f);
            }
            arg0->unk34.x = fn_1_883C(arg0->unk34.x, 0, 0.1f);
#if VERSION_PAL
            if (arg0->unk60 < 75.0f) {
#else
            if (arg0->unk60 < 90.0f) {
#endif
                arg0->unk60++;
            }
            else {
                arg0->unk54 = 3;
            }
            break;

        case 3:
            arg0->unk34.x = fn_1_883C(arg0->unk34.x, -30, 0.1f);
            arg0->unk5C = 1;
            if (arg0->unkC.y - 15.0f > Center.y + CZoom) {
                arg0->unk54 = 4;
                arg0->unk50 = 0;
                Hu3DModelAttrSet(lbl_1_bss_75A8->model[arg0->unk4], HU3D_ATTR_DISPOFF);
            }
            break;

        case 4:
            break;
    }
}

