zeranemesis/Marioparty4/partyboard/src/REL/m408Dll/object.c
void fn_1_1305C(StructBssDA4 *arg0)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    float temp_f27;
    float temp_f26;
    arg0->unk48 += 1.5f;
    if (arg0->unk48 > 360.0f) {
        arg0->unk48 -= 360.0f;
    }
    temp_f29 = cosd(arg0->unk30);
    temp_f28 = sind(arg0->unk30);
    arg0->unk18.x = temp_f29 * arg0->unk64;
    arg0->unk18.z = temp_f28 * arg0->unk64;
    temp_f31 = sind(arg0->unk48);
    arg0->unkC.x = temp_f29 * (60 * temp_f31);
    arg0->unkC.z = temp_f28 * (60 * temp_f31);
    temp_f30 = -arg0->unk30 - 90;
    if (temp_f31 < 0) {
        temp_f30 += 180;
    }
    arg0->unk34.y = fn_1_883C(arg0->unk34.y, temp_f30, 0.05f);
    temp_f30 = fabs(temp_f31);
    arg0->unk34.x = -30 * temp_f30;
    temp_f26 = fn_1_6888();
    switch (arg0->unk54) {
        case 0:
            if (arg0->unkC.y > temp_f26) {
                arg0->unk60 = 0;
                arg0->unk54 = 1;
            }
            arg0->unk5C = 1;
            if (temp_f31 >= sind(75.0f)) {
                temp_f27 = (arg0->unk48 - 75) / 30;
                arg0->unk40[1] = 180 + arg0->unk40[0];
            }
            else if (temp_f31 <= sind(255.0f)) {
                temp_f27 = (arg0->unk48 - 255) / 30;
                arg0->unk40[1] = 180 + arg0->unk40[0];
            }
            else {
                temp_f27 = 0;
                if (arg0->unk40[1] > 360.0f) {
                    arg0->unk40[1] -= 360.0f;
                }
                arg0->unk40[0] = arg0->unk40[1];
            }
            break;

        case 1:
            arg0->unk5C = 0;
            arg0->unkC.y = temp_f26;
            arg0->unk24.x = arg0->unkC.x;
            arg0->unk24.y = arg0->unkC.y + 5;
            arg0->unk24.z = arg0->unkC.z;
            if (arg0->unk60 < REFRESH_RATE_F * 2) {
                arg0->unk60++;
            }
            else {
                arg0->unk54 = 3;
            }
            break;

        case 3:
            arg0->unk5C = 1;
            if (arg0->unkC.y - 15.0f > Center.y + CZoom) {
                arg0->unk54 = 4;
                arg0->unk50 = 0;
                Hu3DModelAttrSet(lbl_1_bss_75A8->model[arg0->unk4], HU3D_ATTR_DISPOFF);
            }
            break;

        case 4:
            break;
    }
}

void fn_1_134D8(StructBssDA4 *arg0)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    arg0->unk30 += 1.8f;
    if (arg0->unk30 > 360.0f) {
        arg0->unk30 -= 360.0f;
    }
    temp_f30 = cosd(arg0->unk30);
    temp_f29 = sind(arg0->unk30);
    arg0->unk64 = 64;
    arg0->unkC.x = temp_f30 * arg0->unk64;
    arg0->unkC.z = temp_f29 * arg0->unk64 * 0.7f;
    temp_f31 = fn_1_6888();
    switch (arg0->unk54) {
        case 0:
            if (arg0->unkC.y > temp_f31) {
                arg0->unk60 = 0;
                arg0->unk54 = 1;
            }
            arg0->unk5C = 1;
            arg0->unk34.y = -arg0->unk30;
            if (arg0->unk34.y > 360.0f) {
                arg0->unk34.y -= 360.0f;
            }
            else if (arg0->unk34.y < 0.0f) {
                arg0->unk34.y += 360.0f;
            }
            break;

        case 1:
            arg0->unk5C = 0;
            arg0->unkC.y = temp_f31;
            arg0->unk24.x = arg0->unkC.x;
            arg0->unk24.y = arg0->unkC.y + 5;
            arg0->unk24.z = arg0->unkC.z;
            arg0->unk34.y -= 10.0f;
            if (arg0->unk34.y > 360.0f) {
                arg0->unk34.y -= 360.0f;
            }
            if (arg0->unk60 < REFRESH_RATE_F * 2) {
                arg0->unk60++;
            }
            else {
                arg0->unk54 = 3;
            }
            break;

        case 3:
            arg0->unk5C = 1;
            if (arg0->unkC.y - 15.0f > Center.y + CZoom) {
                arg0->unk54 = 4;
                arg0->unk50 = 0;
                Hu3DModelAttrSet(lbl_1_bss_75A8->model[arg0->unk4], HU3D_ATTR_DISPOFF);
            }
            break;

        case 4:
            break;
    }
}

void fn_1_13820(StructBssDA4 *arg0)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    float temp_f27;
    float temp_f26;
    float temp_f25;
    float temp_f24;
    float temp_f23;
    float temp_f22;
    float temp_f21;
    float temp_f20;
    float temp_f19;
    float sp8;
    arg0->unk30 += 2.0f;
    if (arg0->unk30 > 360.0f) {
        arg0->unk30 -= 360.0f;
    }
    temp_f26 = cosd(arg0->unk30);
    temp_f25 = sind(arg0->unk30);
    arg0->unk40[1] = 270.0f;
#ifdef NON_MATCHING
    temp_f28 = 0.0f;
    temp_f27 = 0.0f;
#endif
    temp_f29 = arg0->unk18.y;
    switch (arg0->unk54) {
        case 0:
            temp_f31 = 10;
            temp_f28 = temp_f26 * temp_f31;
            temp_f27 = temp_f25 * temp_f31;
            temp_f29 = arg0->unk18.y;
            arg0->unk40[0] = 0;
            arg0->unk34.x = fn_1_883C(arg0->unk34.x, -30, 0.1);
            arg0->unk34.y = 180.0f + (90.0f + -arg0->unk30);
            temp_f30 = fn_1_6888();
            if (temp_f30 < 5.0f + temp_f29) {
                arg0->unk48 = 0;
                arg0->unk54 = 1;
                arg0->unk40[0] = 8;
            }
            arg0->unk5C = 1;
            break;

        case 1:
            arg0->unk48 += 2.0f;
            if (arg0->unk48 > 180.0f) {
                arg0->unk54 = 3;
            }
            arg0->unk40[0] = 0;
            arg0->unk34.x = fn_1_883C(arg0->unk34.x, 40, 0.1);
            arg0->unk34.y = fn_1_883C(arg0->unk34.y, -arg0->unk30, 0.1);
            temp_f23 = cosd(arg0->unk48 * 0.5f);
            temp_f31 = (-100 * temp_f23) + 110;
            temp_f30 = fn_1_6888();
            temp_f28 = temp_f26 * temp_f31;
            temp_f27 = temp_f25 * temp_f31;
            temp_f29 = temp_f30;
            arg0->unk24.x = temp_f28;
            arg0->unk24.y = temp_f30;
            arg0->unk24.z = temp_f27;
            arg0->unk5C = 0;
            break;

        case 3:
            arg0->unk5C = 1;
            arg0->unk54 = 4;
            arg0->unk50 = 0;
            Hu3DModelAttrSet(lbl_1_bss_75A8->model[arg0->unk4], HU3D_ATTR_DISPOFF);
            break;

        case 4:
            break;
    }
    if (arg0->unk34.y > 360) {
        arg0->unk34.y -= 360;
    }
    else if (arg0->unk34.y < 0) {
        arg0->unk34.y += 360;
    }
    sp8 = 0;
    temp_f22 = -cosd(arg0->unk34.x) * 5;
    temp_f24 = -sind(arg0->unk34.x) * 5;
    temp_f21 = temp_f24 * sind(arg0->unk34.y);
    temp_f20 = temp_f22;
    temp_f19 = temp_f24 * cosd(arg0->unk34.y);
    arg0->unkC.x = temp_f21 + temp_f28;
    arg0->unkC.y = temp_f20 + temp_f29;
    arg0->unkC.z = temp_f19 + temp_f27;
}

void fn_1_13D88(StructBssDA4 *arg0)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    arg0->unk30 += 3.0f;
    if (arg0->unk30 > 360.0f) {
        arg0->unk30 -= 360.0f;
    }
    temp_f31 = cosd(arg0->unk30);
    temp_f30 = sind(arg0->unk30);
    temp_f29 = fn_1_6888();
    arg0->unk34.y = (90 + (-arg0->unk30)) + 180 + 90;
    arg0->unkC.x = 1.5f * (10.0f * temp_f31) + arg0->unk18.x;
    arg0->unkC.z = 1.5f * (10.0f * temp_f30) + arg0->unk18.z;
    arg0->unk24.x = arg0->unkC.x;
    arg0->unk24.y = arg0->unkC.y + 5;
    arg0->unk24.z = arg0->unkC.z;
    if (arg0->unkC.y > 5.0f + temp_f29) {
        arg0->unk5C = 1;
    }
    else {
        arg0->unk5C = 0;
    }
    if (arg0->unk5C == 1 && arg0->unkC.y - 15.0f > Center.y + CZoom) {
        arg0->unk50 = 0;
        Hu3DModelAttrSet(lbl_1_bss_75A8->model[arg0->unk4], HU3D_ATTR_DISPOFF);
    }
    if (arg0->unk34.y > 360.0f) {
        arg0->unk34.y -= 360.0f;
    }
    else if (arg0->unk34.y < 0.0f) {
        arg0->unk34.y += 360.0f;
    }
    arg0->unk34.x = fn_1_883C(arg0->unk34.x, -35, 0.1f);
}

void fn_1_1406C(StructBssDA4 *arg0)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    float temp_f27;
    float temp_f26;
    float temp_f25;
    float temp_f24;
    float temp_f23;
    float temp_f22;
    float temp_f21;
    temp_f30 = 1;
    temp_f26 = fn_1_6888();
    switch (arg0->unk54) {
        case 0:
            temp_f29 = cosd(arg0->unk30);
            temp_f28 = sind(arg0->unk30);
            arg0->unkC.x = temp_f29 * (80.0f - (10.0f * temp_f30));
            arg0->unkC.z = temp_f28 * (80.0f - (10.0f * temp_f30)) * 0.7f;
            temp_f24 = temp_f26;
            if (arg0->unkC.y > temp_f24) {
                arg0->unk54 = 1;
                arg0->unk18.x = arg0->unkC.x;
                arg0->unk18.z = arg0->unkC.z;
            }
            arg0->unk5C = 1;
            arg0->unk48 = 0;
            break;

        case 1:
            arg0->unk48 += 1.5f;
            if (arg0->unk48 > 180.0f) {
                arg0->unk54 = 3;
                Hu3DMotionSpeedSet(lbl_1_bss_75A8->model[arg0->unk4], 1);
            }

            temp_f31 = 180 + arg0->unk30;
            if (temp_f31 > 360.0f) {
                temp_f31 -= 360.0f;
            }
            temp_f29 = cosd(temp_f31);
            temp_f28 = sind(temp_f31);
            temp_f25 = cosd(arg0->unk48 * 0.5f);
            temp_f27 = 180.0f;
            temp_f30 = temp_f27 + (temp_f25 * (-temp_f27));
            temp_f23 = arg0->unk18.x + (temp_f29 * temp_f30);
            temp_f21 = arg0->unk18.z + (temp_f28 * temp_f30);
            temp_f22 = temp_f26;
            arg0->unkC.x = temp_f23;
            arg0->unkC.y = temp_f22;
            arg0->unkC.z = temp_f21;
            arg0->unk24.x = arg0->unkC.x;
            arg0->unk24.y = arg0->unkC.y + 5;
            arg0->unk24.z = arg0->unkC.z;
            if (arg0->unk34.x < 30.0f) {
                arg0->unk34.x += 4.0f;
            }
            else {
                arg0->unk34.x = 30.0f;
            }
            Hu3DMotionSpeedSet(lbl_1_bss_75A8->model[arg0->unk4], 2);
            arg0->unk5C = 0;
            break;

        case 3:
            Hu3DModelAttrSet(lbl_1_bss_75A8->model[arg0->unk4], HU3D_ATTR_DISPOFF);
            arg0->unk5C = 1;
            arg0->unk50 = 0;
            arg0->unk54++;
            break;

        case 4:
            break;
    }
}

void fn_1_144D0(StructBssDA4 *arg0)
{
    float temp_f31;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    float temp_f27;
    float temp_f26;
    float temp_f25;
    float temp_f24;
    float temp_f23;
    float temp_f22;
    float temp_f21;
    float temp_f20;
    float temp_f19;
    float temp_f18;
    float spC;
    float sp8;

    arg0->unk30 += 2.0f;
    if (arg0->unk30 > 360.0f) {
        arg0->unk30 -= 360.0f;
    }
    switch (arg0->unk54) {
        case 0:
            arg0->unk5C = 1;
            temp_f31 = cosd(arg0->unk30);
            temp_f30 = sind(arg0->unk30);
            arg0->unkC.x = 15.0f * temp_f31;
            arg0->unkC.z = 15.0f * temp_f30;
            arg0->unk34.y = -arg0->unk30 + 90.0f;
            temp_f24 = fn_1_6888();
#if VERSION_PAL
            temp_f21 = -680.0f + temp_f24;
#else
            temp_f21 = -680.00006f + temp_f24;
#endif
            if (arg0->unkC.y > temp_f21) {
                arg0->unk54 = 1;
                arg0->unk60 = 0;
            }
            break;

        case 1:
#if VERSION_PAL
            if (arg0->unk60 < 85.0f) {
                arg0->unk60++;
                temp_f27 = arg0->unk60 / 85.0f;
#else
            if (arg0->unk60 < 102.0f) {
                arg0->unk60++;
                temp_f27 = arg0->unk60 / 102.0f;
#endif
                temp_f29 = 15 + (35 * temp_f27);
                temp_f22 = 90 * temp_f27;
                temp_f31 = cosd(arg0->unk30);
                temp_f30 = sind(arg0->unk30);
                arg0->unkC.x = temp_f31 * temp_f29;
                arg0->unkC.z = temp_f30 * temp_f29;
                arg0->unk34.y = (-arg0->unk30 + 90.0f) - temp_f22;
            }
            else {
                arg0->unk54 = 2;
                arg0->unk60 = 0;
                Hu3DMotionSpeedSet(lbl_1_bss_75A8->model[arg0->unk4], 2);
            }
            break;

