zeranemesis/Marioparty4/partyboard/src/REL/m408Dll/object.c
        case 2:
            temp_f31 = cosd(arg0->unk30);
            temp_f30 = sind(arg0->unk30);
            temp_f24 = fn_1_6888();
            temp_f26 = 50 * temp_f31;
            temp_f28 = temp_f24;
            temp_f25 = 50 * temp_f30;
            arg0->unkC.x = temp_f26;
            arg0->unkC.y = temp_f28;
            arg0->unkC.z = temp_f25;
            if (arg0->unk34.x < 30.0f) {
                arg0->unk34.x += 4.0f;
            }
            else {
                arg0->unk34.x = 30.0f;
            }
            arg0->unk34.y = (-arg0->unk30 + 90.0f) - 90.0f;
            if (arg0->unk60 < REFRESH_RATE_F * 3) {
                arg0->unk60++;
            }
            else {
                arg0->unk54 = 3;
                arg0->unk60 = 0;
                arg0->unk18.y = temp_f28;
                Hu3DMotionSpeedSet(lbl_1_bss_75A8->model[arg0->unk4], 1);
            }
            arg0->unk24.x = temp_f26;
            arg0->unk24.y = 5.0f + temp_f28;
            arg0->unk24.z = temp_f25;
            arg0->unk5C = 0;
            break;

        case 3:
#if VERSION_PAL
            if (arg0->unk60 < 125.0f) {
#else
            if (arg0->unk60 < 150.0f) {
#endif
                arg0->unk60++;
            }
            else {
                arg0->unk54 = 4;
                Hu3DModelAttrSet(lbl_1_bss_75A8->model[arg0->unk4], HU3D_ATTR_DISPOFF);
            }
            temp_f27 = 0;
            temp_f29 = 50 + (40 * temp_f27);
            temp_f31 = cosd(arg0->unk30);
            temp_f30 = sind(arg0->unk30);
            temp_f26 = temp_f31 * temp_f29;
            temp_f28 = arg0->unk18.y;
            temp_f25 = temp_f30 * temp_f29;
            spC = 0;
            temp_f20 = -cosd(arg0->unk34.x) * 5;
            temp_f23 = -sind(arg0->unk34.x) * 5;
            temp_f19 = temp_f23 * sind(arg0->unk34.y);
            temp_f18 = temp_f20;
            sp8 = temp_f23 * cosd(arg0->unk34.y);
            arg0->unkC.x = temp_f19 + temp_f26;
            arg0->unkC.y = temp_f18 + temp_f28;
            arg0->unkC.z = sp8 + temp_f25;
            if (arg0->unk34.y > 360.0f) {
                arg0->unk34.y -= 360.0f;
            }
            arg0->unk34.y = (-arg0->unk30 + 90.0f) - 90.0f;
            arg0->unk5C = 1;
            break;

        case 4:
            if (arg0->unk5C == 1 && arg0->unkC.y - 15.0f > Center.y + CZoom) {
                arg0->unk50 = 0;
                Hu3DModelAttrSet(lbl_1_bss_75A8->model[arg0->unk4], HU3D_ATTR_DISPOFF);
            }
            break;
    }
    if (arg0->unk34.y > 360.0f) {
        arg0->unk34.y -= 360.0f;
    }
    else if (arg0->unk34.y < 0.0f) {
        arg0->unk34.y += 360.0f;
    }
}

void fn_1_14DB4(StructBssDA4 *arg0)
{
    s32 temp_r30;
    float temp_f31;
    float temp_f30;
    float temp_f29;
    temp_f30 = cosd(arg0->unk30);
    temp_f29 = sind(arg0->unk30);
    arg0->unkC.x = 32.0f * temp_f30;
    arg0->unkC.z = 32.0f * temp_f29;
    temp_f31 = fn_1_6888();
    switch (arg0->unk54) {
        case 0:
            if (arg0->unkC.y > temp_f31) {
                arg0->unk54 = 1;
                arg0->unk60 = 0;
            }
            arg0->unk34.x += 4.0f;
            arg0->unk5C = 1;
            break;

        case 1:
            arg0->unk5C = 0;
            if (arg0->unk58) {
                arg0->unk5C = 1;
                arg0->unk54 = 4;
                arg0->unk60 = 0;
                temp_r30 = lbl_1_bss_75A8->model[arg0->unk8];
                Hu3DModelAttrReset(temp_r30, HU3D_ATTR_DISPOFF);
                fn_1_15B50(temp_r30);
                fn_1_155E0(temp_r30, 1);
                fn_1_15618(temp_r30, arg0->unkC.x, arg0->unkC.y, arg0->unkC.z);
                HuAudFXPlay(7);
            }
            else {
#if VERSION_PAL
                if (arg0->unk60 < 60.000004f) {
#else
                if (arg0->unk60 < 72.0f) {
#endif
                    arg0->unk60++;
                    arg0->unkC.y = temp_f31;
                }
                else {
                    arg0->unk54 = 3;
                }
                arg0->unk34.x += 8.0f;
                arg0->unk34.y += 8.0f;
            }
            break;

        case 3:
            arg0->unk34.x += 4.0f;
            arg0->unk5C = 1;
            break;

        case 4:
            if (arg0->unk60 < REFRESH_RATE_F / 2) {
                arg0->unk34.x = 90;
                arg0->unk34.y += 32.0f;
                if (arg0->unk60 > 5) {
                    fn_1_155E0(lbl_1_bss_75A8->model[arg0->unk8], 0);
                }
                arg0->unk4C *= 0.8f;
                arg0->unk60++;
            }
            else {
                arg0->unk50 = 0;
                Hu3DModelAttrSet(lbl_1_bss_75A8->model[arg0->unk4], HU3D_ATTR_DISPOFF);
            }
            break;
    }
    if (arg0->unk34.x > 360.0f) {
        arg0->unk34.x -= 360.0f;
    }
    if (arg0->unk34.y > 360.0f) {
        arg0->unk34.y -= 360.0f;
    }
    arg0->unk24.x = arg0->unkC.x;
    arg0->unk24.y = arg0->unkC.y;
    arg0->unk24.z = arg0->unkC.z;
}

void fn_1_151A4(StructBssDA4 *arg0)
{
    s32 temp_r30;
    float temp_f31;
    float temp_f30;
    float temp_f29;

#if VERSION_PAL
    arg0->unk48 += 7.2f;
#else
    arg0->unk48 += 6.0000005f;
#endif
    if (arg0->unk48 >= 360.0f) {
        arg0->unk48 -= 360.0f;
    }
    arg0->unk34.z = 30 * sind(arg0->unk48);
    temp_f30 = cosd(arg0->unk30);
    temp_f29 = sind(arg0->unk30);
    arg0->unkC.x = 32.0f * temp_f30;
    arg0->unkC.z = 32.0f * temp_f29;
    temp_f31 = fn_1_6888();
    switch (arg0->unk54) {
        case 0:
            if (arg0->unkC.y > temp_f31) {
                arg0->unk54 = 1;
                arg0->unk60 = 0;
            }
            arg0->unk34.x = -45;
            arg0->unk34.y = 0;
            arg0->unk5C = 1;
            break;

        case 1:
            arg0->unk5C = 0;
            if (arg0->unk58) {
                arg0->unk5C = 1;
                arg0->unk54 = 4;
                arg0->unk60 = 0;
                temp_r30 = lbl_1_bss_75A8->model[arg0->unk8];
                Hu3DModelAttrReset(temp_r30, HU3D_ATTR_DISPOFF);
                fn_1_15B50(temp_r30);
                fn_1_155E0(temp_r30, 1);
                fn_1_15618(temp_r30, arg0->unkC.x, arg0->unkC.y, arg0->unkC.z);
                HuAudFXPlay(19);
            }
            else {
#if VERSION_PAL
                if (arg0->unk60 < 60.000004f) {
#else
                if (arg0->unk60 < 72.0f) {
#endif
                    arg0->unk60++;
                    arg0->unkC.y = temp_f31;
                }
                else {
                    arg0->unk54 = 3;
                }
            }
            break;

        case 3:
            arg0->unk5C = 1;
            break;

        case 4:
            if (arg0->unk60 < REFRESH_RATE_F / 2) {
                arg0->unk34.x = 90;
                arg0->unk34.y += 32.0f;
                if (arg0->unk60 > 5) {
                    fn_1_155E0(lbl_1_bss_75A8->model[arg0->unk8], 0);
                }
                arg0->unk4C *= 0.8f;
                arg0->unk60++;
            }
            else {
                arg0->unk50 = 0;
                Hu3DModelAttrSet(lbl_1_bss_75A8->model[arg0->unk4], HU3D_ATTR_DISPOFF);
            }
            break;
    }
    if (arg0->unk34.x > 360.0f) {
        arg0->unk34.x -= 360.0f;
    }
    if (arg0->unk34.y > 360.0f) {
        arg0->unk34.y -= 360.0f;
    }
    arg0->unk24.x = arg0->unkC.x;
    arg0->unk24.y = arg0->unkC.y;
    arg0->unk24.z = arg0->unkC.z;
}

